Reports/Лен_ХронологияИзмененияРеквизитовУправл.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>Лен_ХронологияИзмененияРеквизитовУправл</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВнешнююБазу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АнализируемыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АтоматическийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВходящиеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метаданные</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Компьютер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодОбъекта</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Catalogs/ГруппыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ГруппыДоступа</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиГруппДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Только для персональных групп доступа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяГруппаДоступаПоставляемогоПрофиля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыВнешнихПользователей</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Comment>Представлен пустой ссылкой основного типа значений</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсеРазрешены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Comment>Представлен пустой ссылкой основного типа значений</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПрофилиГруппДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПрофилиГруппДоступа</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоставляемыхДанных</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставляемыйПрофильИзменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Comment>Представлен пустой ссылкой основного типа значений</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предустановленный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсеРазрешены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Comment>Представлен пустой ссылкой основного типа значений</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Назначение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипПользователей</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/Лен_ХронологияИзмененияРеквизитовУправл/Forms/ФормаОтчета1/Ext/Form/Module.bsl
&НаКлиенте
Перем СписокВыбораВидаОперации;
&НаКлиенте
Перем БазовыйМеханизмПодбораВариантовНастроек;

&НаКлиенте
Процедура ОбработкаНажатияКнопкиВыбораВыриантаСохраненнойНастройки(Элемент)
	
	Индекс = Число(Сред(Элемент.Имя, 30));
	
	ВыбранныйВариантСохраненнойНастройки = Отчет.ТаблицаВариантовСохраненныхНастроекОтчета[Индекс].Ссылка;
	
	Если Не ВыбранныйВариантСохраненнойНастройки.Пустая() И ВыбранныйВариантСохраненнойНастройки.ПолучитьОбъект() = Неопределено Тогда
		
		Предупреждение("Вариант отчета """ + Элемент.ТекстНевыбраннойКартинки + """ удален.",15);
		
		ОбновитьКнопкиВыбораВыриантовСохраненныхНастроек();
		
		Если Отчет.ТаблицаВариантовСохраненныхНастроекОтчета.Количество() = 0 Тогда
		
			ОтображениеПанелиВыбораВариантовСохраненныхНастроек(Элементы.ДействияФормы.Кнопки.ОтображениеПанелиВыбораВариантовСохраненныхНастроек);		
		
		КонецЕсли;		
		
		Возврат;
		
	ИначеЕсли ВыбранныйВариантСохраненнойНастройки.ПометкаУдаления Тогда
		
		Предупреждение("Вариант отчета """ + Элемент.ТекстНевыбраннойКартинки + """ помечен на удаление.",15);
		
		ОбновитьКнопкиВыбораВыриантовСохраненныхНастроек();
		
		Если Отчет.ТаблицаВариантовСохраненныхНастроекОтчета.Количество() = 0 Тогда
		
			ОтображениеПанелиВыбораВариантовСохраненныхНастроек(Элементы.ДействияФормы.Кнопки.ОтображениеПанелиВыбораВариантовСохраненныхНастроек);		
		
		КонецЕсли;			
		
		Возврат;		
		
	КонецЕсли;
	
	ОтображенияПометкиВыбраннойСохраненнойНастройки(Элемент);	
	
	Если Не БазовыйМеханизмПодбораВариантовНастроек Тогда
		
		СохраненнаяНастройка = Отчет.ТаблицаВариантовСохраненныхНастроекОтчета[Индекс].Ссылка;
		
		Отчет.ПрименитьНастройку();
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКнопкуВыбораВариантаСохраненнойНастройки(Индекс, Заголовок, Описание)
	
	Кнопка = Элементы.Добавить(Тип("ПолеКартинки"), "КнопкаВыбораВариантаНастройки" + Индекс, Истина, Элементы.ПанельВыбораВариантовСохраненныхНастроек);		
		
	Кнопка.Рамка                    = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная,1);
	Кнопка.ГиперСсылка 				= Истина;
	Кнопка.ТекстНевыбраннойКартинки = Заголовок;
	Кнопка.Лево 					= ?(Индекс = 0,2,Элементы["КнопкаВыбораВариантаНастройки" + (Индекс - 1)].Лево + 131);
	Кнопка.Верх 					= 2;
	Кнопка.Ширина 					= 130;
	Кнопка.Высота					= 42;
	Кнопка.ЦветФона 				= WebЦвета.Лазурный;
	Кнопка.ЦветТекста 				= WebЦвета.Черный;
	Кнопка.АвтоКонтекстноеМеню 		= Ложь;
	Кнопка.Подсказка 				= Описание;
	
	Кнопка.УстановитьДействие("Нажатие", Новый Действие("ОбработкаНажатияКнопкиВыбораВыриантаСохраненнойНастройки"));	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКнопкиВыбораВыриантовСохраненныхНастроек()
	
	колич = КоличествоСтрокТаблицыВариантовСохрНастроекОтчета();
	
	Для Индекс = 0 По колич - 1 Цикл		
		
		Кнопка = Элементы["КнопкаВыбораВариантаНастройки" + Индекс];
		
		Элементы.Удалить(Кнопка);
			
	КонецЦикла;
	
	ЗаполнитьТаблицуДоступныхВариантовСохраненныхНастроек1();	
	
	Для Индекс = 0 По колич - 1 Цикл
		
		//Строка = Отчет.ТаблицаВариантовСохраненныхНастроекОтчета.Получить(Индекс);
		Строка = ПолучитьСтрокуТаблицыВариантовСохрНастроекОтчета(Индекс);
		
		ДобавитьКнопкуВыбораВариантаСохраненнойНастройки(Индекс, Строка.Наименование, Строка.Описание);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция КоличествоСтрокТаблицыВариантовСохрНастроекОтчета()
	
	Док = РеквизитФормыВЗначение("Отчет");	
	возврат Док.ТаблицаВариантовСохраненныхНастроекОтчета.Количество();
	
КонецФункции

&НаСервере
Функция ПолучитьСтрокуТаблицыВариантовСохрНастроекОтчета(Индекс)
	
	Док = РеквизитФормыВЗначение("Отчет");	
	возврат Док.ТаблицаВариантовСохраненныхНастроекОтчета.Получить(Индекс);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуДоступныхВариантовСохраненныхНастроек1()
	
	Док = РеквизитФормыВЗначение("Отчет");
	Док.ЗаполнитьТаблицуДоступныхВариантовСохраненныхНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗначения(Кнопка)
	
	//СохранениеНастроек.ВыбратьНастройкуФормы(СохраненнаяНастройка, ЭтаФорма, "ОтчетОбъект." + ЭтотОбъект.Метаданные().Имя, Истина);	
	СохрНастроек(истина);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяОбъекта(Отчет)
	возврат Отчет.Метаданные().Имя
КонецФункции

&НаКлиенте
Процедура СохрНастроек(Признак)
	Лен_СохранениеНастроекКлиент.ВыбратьНастройкуФормы(Отчет.СохраненнаяНастройка, ЭтаФорма, "ОтчетОбъект." +  ПолучитьИмяОбъекта(Отчет), Признак);	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьЗначения(Кнопка)
	
	//СохранениеНастроек.ВыбратьНастройкуФормы(СохраненнаяНастройка, ЭтаФорма, "ОтчетОбъект." + ЭтотОбъект.Метаданные().Имя, Ложь);	
	СохрНастроек(ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступныеВидыСравнения(Значение)
	
	Если Значение.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗначениеРеквизита")
		ИЛИ Значение.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект") Тогда
		
		Значение.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;					
		Поле = Отчет.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(Значение.ЛевоеЗначение);
		
		Поле.ДоступныеВидыСравнения.Очистить();		
		Поле.ДоступныеВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Равно);		
		Поле.ДоступныеВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);		
		
	ИначеЕсли Значение.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Реквизит") 
		ИЛИ Значение.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Метаданные")
		ИЛИ Значение.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Компьютер") Тогда
		
		Значение.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;				
		
		Поле = Отчет.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(Значение.ЛевоеЗначение);		
		Поле.ДоступныеВидыСравнения.Очистить();
		
		Поле.ДоступныеВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Равно);		
		Поле.ДоступныеВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);			
		Поле.ДоступныеВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.Содержит);			
		Поле.ДоступныеВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеСодержит);						
		Поле.ДоступныеВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);		
		Поле.ДоступныеВидыСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВидовСравнения()
	
	Для Каждого Значение Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		
		УстановитьДоступныеВидыСравнения(Значение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии()
	
	Если Отчет.АтоматическийРежим Тогда
		
		Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтображениеПанелиБыстрогоОтбора.Пометка = Истина;
		
	КонецЕсли;
	
	ЭтаФорма.Элементы.Результат.ОтображениеСостояния.Видимость = ложь;
	ОтображениеПанелиБыстрогоОтбора(Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтображениеПанелиБыстрогоОтбора);
		
	ОбновитьКнопкиВыбораВыриантовСохраненныхНастроек();		
	
	ОтображениеПанелиВыбораВариантовСохраненныхНастроек(Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтображениеПанелиВыбораВариантовСохраненныхНастроек);	
	
	ОбработкаВидовСравнения();
	
	//Если НЕ Лен_ОбщегоНазначенияКлиент.РольДоступнаНаКлиенте("ПолныеПрава") Тогда
	Если НЕ ЕстьРоль("ПолныеПрава") Тогда	
		Элементы.Отбор.ИзменятьСоставСтрок = Ложь;		
		Элементы.ПанельБыстрыхНастроек.ПодчиненныеЭлементы.Группа7.Доступность = Ложь;	// ВыбранныеПоля
		Элементы.ПанельБыстрыхНастроек.ПодчиненныеЭлементы.Группа8.Доступность = Ложь;	// Параметры		
		Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаРежимНастроекЭксперт.Доступность = Ложь;			// РежимНастроекЭксперт
		
	КонецЕсли;
	
	//Нужно доработать
	//СохранениеНастроек.ЗаполнитьНастройкиПриОткрытииОтчета(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда) 
		
	СформироватьОтчетИзОбъекта(ЭтаФорма.Результат, ЭтаФорма.ДанныеРасшифровки);	
			
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетИзОбъекта(Результат, ДанныеРасшифровки) Экспорт
	
	ЭтаФорма.Элементы.Результат.ОтображениеСостояния.Видимость = ложь;
	Док = РеквизитФормыВЗначение("Отчет");	
	Док.Сформировать(Результат, ДанныеРасшифровки); 
	
	//Никифоров
	ДанныеРасшифровки = "";
	
	ЭтаФорма.Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения=ДополнительныйРежимОтображения.НеИспользовать;
	ЭтаФорма.Элементы.Результат.ОтображениеСостояния.Видимость = ложь;

	ЭтаФорма.ВариантМодифицирован = Ложь; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)

	//НастройкаПериода = ПолучитьНастройкуПериода();
	НастройкаПериода = Новый ДиалогРедактированияСтандартногоПериода;
	СтандПериод = Новый СтандартныйПериод;
	СтандПериод.ДатаНачала = Отчет.НачалоПериода;
	СтандПериод.ДатаОкончания = ?(Отчет.КонецПериода='0001-01-01', Отчет.КонецПериода, КонецДня(Отчет.КонецПериода));
	НастройкаПериода.Период = СтандПериод;
	
	Если НастройкаПериода.Редактировать() Тогда		
		Отчет.НачалоПериода = НастройкаПериода.Период.ДатаНачала;
		Отчет.КонецПериода  = НастройкаПериода.Период.ДатаОкончания;		
	КонецЕсли;

	УстановитьПроверитьПериодОтчетаСКлиента();	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПроверитьПериодОтчетаСКлиента()
	
	Док = РеквизитФормыВЗначение("Отчет");
	Док.УстановитьПроверитьПериодОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	Отчет.УстановитьПроверитьПериодОтчета();		
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	Отчет.УстановитьПроверитьПериодОтчета();		
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПанелиБыстрогоОтбора(Кнопка)
	
	//Если Кнопка.Пометка Тогда
	СамаКнопка = Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтображениеПанелиБыстрогоОтбора;
	Если СамаКнопка.Пометка Тогда
		
		СамаКнопка.Пометка = Ложь;
		
		//Элементы.Разделитель.Свертка 			= РежимСверткиЭлементаУправления.Лево;
		//Элементы.ПанельБыстрыхНастроек.Свертка  = РежимСверткиЭлементаУправления.Лево;
		Элементы.ПанельБыстрыхНастроек.Видимость = ложь;
		//Элементы.Результат.Свертка				= РежимСверткиЭлементаУправления.Лево;			
		
	Иначе
		
		СамаКнопка.Пометка = Истина;
		
		//Элементы.Разделитель.Свертка 		     = РежимСверткиЭлементаУправления.Нет;
		Элементы.ПанельБыстрыхНастроек.Видимость = истина;		
		//Элементы.Результат.Свертка				 = РежимСверткиЭлементаУправления.Нет;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПанелиВыбораВариантовСохраненныхНастроек(Кнопка)
	
	колич = КоличествоСтрокТаблицыВариантовСохрНастроекОтчета();
	СамаКнопка = Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтображениеПанелиВыбораВариантовСохраненныхНастроек;
	//Если Кнопка.Пометка Тогда
	Если СамаКнопка.Пометка Тогда
		
		Если колич = 0 Тогда
			
			СамаКнопка.Доступность = Ложь;
			
		Иначе
			
			СамаКнопка.Доступность = Истина;			
			
		КонецЕсли;
			
		СамаКнопка.Пометка = Ложь;			
		//Элементы.ПанельВыбораВариантовСохраненныхНастроек.Свертка = РежимСверткиЭлементаУправления.Верх;	
		Элементы.ГруппаВарианта.Видимость = ложь;	
		
	Иначе		
		
		Если колич = 0 Тогда
			
			//Элементы.ПанельВыбораВариантовСохраненныхНастроек.Свертка = РежимСверткиЭлементаУправления.Верх;					
			Элементы.ГруппаВарианта.Видимость = ложь;	
			СамаКнопка.Доступность = Ложь;			
			СамаКнопка.Пометка = Ложь;
			
		Иначе
		
			//Элементы.ПанельВыбораВариантовСохраненныхНастроек.Свертка = РежимСверткиЭлементаУправления.Нет;					
			Элементы.ГруппаВарианта.Видимость = истина;	
			СамаКнопка.Доступность = Истина;						
			СамаКнопка.Пометка = Истина;
			
		КонецЕсли;
			
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображенияПометкиВыбраннойСохраненнойНастройки(Элемент)
	
	Для Индекс = 0 По Отчет.ТаблицаВариантовСохраненныхНастроекОтчета.Количество() - 1 Цикл		
		
		Кнопка = Элементы["КнопкаВыбораВариантаНастройки" + Индекс];
			
		Если Кнопка <> Элемент Тогда			
			Кнопка.ЦветФона	= WebЦвета.Лазурный;						
		КонецЕсли;
		
	КонецЦикла;
	
	Элемент.ЦветФона = WebЦвета.Лимонный;	
	ЭтаФорма.ТекущийЭлемент = Элемент;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимНастроекЭксперт(Кнопка)
		
	Кнопка.Пометка = Истина;
		
	Если Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтображениеПанелиБыстрогоОтбора.Пометка Тогда
		ОтображениеПанелиБыстрогоОтбора(Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтображениеПанелиБыстрогоОтбора);	
	КонецЕсли;	
	
	//ФормаНастроекЭксперт = ПолучитьФормуНастроек("ФормаНастройки",ЭтаФорма);
	//
	//ФормаНастроекЭксперт.ОткрытьМодально();
		
	Кнопка.Пометка = Ложь;	
	
	Если НЕ Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтображениеПанелиБыстрогоОтбора.Пометка Тогда
		ОтображениеПанелиБыстрогоОтбора(Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаОтображениеПанелиБыстрогоОтбора);	
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ЗначениеВыбора, Источник)
	
	ВыбранныйВариантСохраненнойНастройки = Отчет.ТаблицаВариантовСохраненныхНастроекОтчета.Найти(ЗначениеВыбора,"Ссылка");
	
	Если ВыбранныйВариантСохраненнойНастройки <> Неопределено Тогда
		
		БазовыйМеханизмПодбораВариантовНастроек = Истина;
		
		Кнопка = Элементы["КнопкаВыбораВариантаНастройки" + Отчет.ТаблицаВариантовСохраненныхНастроекОтчета.Индекс(ВыбранныйВариантСохраненнойНастройки)];
		
		ОбработкаНажатияКнопкиВыбораВыриантаСохраненнойНастройки(Кнопка);
		
		БазовыйМеханизмПодбораВариантовНастроек = Ложь;			
		
	Иначе
		
		ОбновитьКнопкиВыбораВыриантовСохраненныхНастроек();		
		
	КонецЕсли;		
	
КонецПроцедуры

// почему-то этого события нету!!!
&НаКлиенте
Процедура ОтборПриПолученииДанных(Элемент, ОформленияСтрок)
	
	Если Не ЕстьРоль("ПолныеПрава") Тогда
			
		Для Каждого Значение Из ОформленияСтрок Цикл
			
			Если ТипЗнч(Значение.ДанныеСтроки) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				
				Если Значение.ДанныеСтроки.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект") Тогда
					
					Значение.Ячейки.ВидыСравненияДляКраткогоОтображенияЭлемента.ТолькоПросмотр = Истина;								
					Значение.Ячейки.ВидыСравненияДляПодробногоОтображенияЭлементаГлавногоОтбора.ТолькоПросмотр = Истина;									
					Значение.Ячейки.ЛевоеЗначениеДляКраткогоОтображенияЭлемента.ТолькоПросмотр = Истина;								
					Значение.Ячейки.ЛевоеЗначениеДляПодробногоОтображенияЭлементаГлавногоОтбора.ТолькоПросмотр = Истина;						
					Значение.Ячейки.ПравоеЗначениеДляКраткогоОтображенияЭлемента.ТолькоПросмотр = Истина;								
					Значение.Ячейки.ПравоеЗначениеДляПодробногоОтображенияЭлементаГлавногоОтбора.ТолькоПросмотр = Истина;													
					Значение.Ячейки.ПредставлениеДляКраткогоОтображенияЭлемента.ТолькоПросмотр = Истина;								
					Значение.Ячейки.ПредставлениеДляПодробногоОтображенияЭлементаГлавногоОтбора.ТолькоПросмотр = Истина;					
					Значение.Ячейки.РежимОтображенияДляПодробногоОтображенияЭлементаГлавногоОтбора.ТолькоПросмотр = Истина;									
					Значение.Ячейки.Использование.ТолькоПросмотр = Истина;
					
				Иначе
					
					Значение.Ячейки.ЛевоеЗначениеДляКраткогоОтображенияЭлемента.ТолькоПросмотр = Истина;								
					Значение.Ячейки.ЛевоеЗначениеДляПодробногоОтображенияЭлементаГлавногоОтбора.ТолькоПросмотр = Истина;						
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьРоль(ИмяРоли, Пользователь = Неопределено) Экспорт

	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	1 
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
		|		ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка
		|ГДЕ
		|	ПрофилиГруппДоступаРоли.Роль.Имя = &Роль
		|	И ГруппыДоступаПользователи.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Роль", ИмяРоли);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;		
	Иначе	
		Возврат Истина;		
	КонецЕсли;
	
КонецФункции


БазовыйМеханизмПодбораВариантовНастроек = Ложь;
